src/DataProcessors/ЗагрузкаНормТехОпераций/ЗагрузкаНормТехОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаНормТехОпераций</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/НормыТО/НормыТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыТО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МашинноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаНастройку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаОбдув</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ЗагрузкаНормТехОпераций/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.НаДату = НачалоМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура НаДатуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Объект.НаДату = НачалоМесяца(Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНормыТО(Норма, Стоимость, МашинноеВремя, НормаВремениНаНастройку, НормаВремениНаОбдув, ВнутреннийКод)
	Попытка
	ТехОперация = ЗначениеИзСтрокиВнутр(ВнутреннийКод);
	НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Объект.НаДату,Новый Структура("ТехОперация",ТехОперация));
		Если (НормыТО.Норма <> Норма)или(НормыТО.Стоимость <> Стоимость)или(НормыТО.МашинноеВремя <> МашинноеВремя)или(НормыТО.НормаВремениНаНастройку <> НормаВремениНаНастройку)или(НормыТО.НормаВремениНаОбдув <> НормаВремениНаОбдув) Тогда
		НормыТО = РегистрыСведений.НормыТО.СоздатьМенеджерЗаписи();
		НормыТО.Период = Объект.НаДату;
		НормыТО.ТехОперация = ТехОперация;    
		НормыТО.Норма = Норма;
		НормыТО.Стоимость = Стоимость;
		НормыТО.МашинноеВремя = МашинноеВремя;
		НормыТО.НормаВремениНаНастройку = НормаВремениНаНастройку;
		НормыТО.НормаВремениНаОбдув = НормаВремениНаОбдув;
		НормыТО.Записать(Истина);
		КонецЕсли; 		
	Исключение
	Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры 

&НаКлиенте
Процедура Загрузить(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c нормами тех. операций");
	Если Результат <> Неопределено Тогда
	СЗ = Новый СписокЗначений;

	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 1 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка норм тех. операций из файла...");
			Если Найти(ExcelЛист.Cells(к,7).Value,"{") > 0 Тогда
        	ЗагрузитьНормыТО(ExcelЛист.Cells(к,2).Value,ExcelЛист.Cells(к,3).Value,ExcelЛист.Cells(к,4).Value,ExcelЛист.Cells(к,5).Value,ExcelЛист.Cells(к,6).Value,ExcelЛист.Cells(к,7).Value);			
			КонецЕсли;
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;  
КонецПроцедуры
